Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: 1=absolute, 0=relative, 2=client
fr: Copiez tout ce que vous voulez changer, la valeur par défaut est indiqué en premier

source: 0=don't expand, 1=do expand
fr: 1=absolue, 0=relative, 2=client

source: 1=ESC closes, 0=ESC won't close
fr: 1=ESC ferme, 0=ESC ne ferme pas

source: 1=absolute, 0=relative, 2=cell
fr: 1=absolue, 0=relative, 2=cellule

source: "|" is the default
fr: "|" est la valeur par défaut

source: 0=disabled, 1=OnEvent mode enabled
fr: 0=désactivé, 1 mode=OnEvent activé

source: 0=no resizing, <1024 special resizing
fr: 0=pas de redimensionnement, < 1024 redimensionnement spécial

source: 0=default, 1=just notification, 2=GUICtrlRead tab index
fr: 0=défaut, 1=juste notification, 2=GUICtrlRead index de tabulation

source: 10 milliseconds
fr: 10 millisecondes

source: 250 milliseconds
fr: 250 millisecondes

source: 0=no, 1=require pre-declaration
fr: 0=non, 1=requiert pré-déclaration

source: 0=don't attach, 1=do attach
fr: 0=n'attache pas, 1=attache

source: 1=store and restore, 0=don't
fr: 1=sauvegarde et restaure, 0=ne le fait pas

source: 5 milliseconds
fr: 5 millisecondes

source: 1 millisecond
fr: 1 milliseconde

source: 100 milliseconds
fr: 100 millisecondes

source: 0=no pause, 1=Pause
fr: 0=pas de pause, 1=pause

source: 0=no info, 1=debug line info
fr: 0=pas d'info, 1=info de débogage de ligne

source: 0=show, 1=hide tray icon
fr: 0=montre, 1=masque l'icône de plateau

source: 0=append, 1=no default menu, 2=no automatic check, 4=menuitemID not return
fr: 0=ajoute, 1=pas de menu par défaut, 2=pas de vérification automatique, 4=menuitemID sans retour

source: 0=disable, 1=enable
fr: 0=désactivé, 1=activé

source: 0=don't detect, 1=do detect
fr: 0=ne détecte pas, 1=détecte

source: 0=no, 1=search children also
fr: 0=non, 1=recherche les enfants aussi

source: 1=complete, 2=quick
fr: 1=complet, 2=rapide

source: 1=start, 2=subStr, 3=exact, 4=advanced, -1 to -4=Nocase
fr: 1=début, 2=sous-chaîne, 3=exact, 4=avancé, -1 à -4=NOCASE

source: Retrieves the title of the AutoIt window.
fr: Récupère le titre d'une fenêtre Autoit.

source: Returns a string containing the title of the AutoIt window.
fr: Retourne une chaine de caractères contenant le titre de la fenêtre Autoit.

source: Set the title of of the AutoIt Hidden Window.
fr: Définit le titre de la fenêtre cachée d'AutoIt.

source: Display AutoIt's Hidden Window.
fr: Affiche la fenêtre cachée d' AutoIt.

source: Display AutoIt"s Hidden Window.
fr: Affiche la fenêtre cachée d'AutoIt.

source: Returns the handle of the window.
fr: Retourne le handle de la fenêtre.

source: Get the handle of the AutoIt Hidden Window by finding out the title of the AutoIt Hidden Window.
fr: Obtient le handle de la fenêtre cachée d'AutoIt à partir du titre de la fenêtre cachée AutoIt.

source: Move the AutoIt Hidden Window and re-size for a better view.
fr: Déplace la fenêtre cachée AutoIt et la redimensionne pour une meilleure vue.

source: Show the AutoIt Hidden Window, normally this is hidden, but in the interest of this example I"m displaying it.
fr: Montre la fenêtre cachée AutoIt, normalement elle est cachée, mais dans l'intérêt de cet exemple, je la montre.

source: Changes the title of the AutoIt window.
fr: Modifie le titre d'une fenêtre Autoit.

source: The new title to give to the window.
fr: Le nouveau titre à donner à la fenêtre.

source: The AutoIt window is usually hidden.
fr: La fenêtre Autoit est habituellement cachée.

source: The purpose of changing the title is to allow other programs (or other AutoIt scripts) to interact with AutoIt.
fr: L’intérêt de changer son titre est d'autoriser d'autres programmes (ou d'autres scripts Autoit) à interagir avec Autoit.

source: Check if the script is already running
fr: Vérifie si le script est déjà en cours d'exécution

source: Note:
fr: Remarque:

source: The recommended approach is to use _Singleton from Misc.au3
fr: L'approche recommandée est d'utiliser _Singleton de Misc.au3

source: The script is already running
fr: Le script est déjà en cours d'exécution

source: This is the first instance of the script.
fr: Il s'agit de la première instance du script.

source: Set the autoit window title
fr: Définit le titre de la fenêtre AutoIt

source: Run this script again.
fr: Exécute de nouveau ce script.

source: Plays back a beep to the user.
fr: Reproduit un bip sonore à l'utilisateur.

source: The frequency of the beep in hertz.
fr: La fréquence du bip en hertz.

source: Can be anywhere from 37 through 32,767 (0x25 through 0x7FFF).
fr: Peut être compris entre 37 et 32767 (0x25 et 0x7FFF).

source: Default is 500 Hz.
fr: La valeur par défaut est 500 Hz.

source: The length of the beep in milliseconds.
fr: La longueur du bip en millisecondes.

source: Default = 1000 ms.
fr: Par défaut = 1000 ms.

source: None.(Always returns 1 regardless of success.)
fr: Retourne toujours 1 indépendamment d'un succès ou d'un échec.

source: plays back a beep noise, at the frequency 500 for 1 second
fr: Produit un son, à la fréquence de 500hz pendant 1 seconde

source: Returns the binary representation of an expression.
fr: Retourne la représentation binaire d'une expression.

source: An expression to convert into binary/byte data.
fr: Une expression à convertir en données binaire/octet.

source: Returns a Binary variant.
fr: Retourne le type 'variant' Binary.

source: See language datatypes for a detailed description.
fr: Consultez Types de données du Langage pour une description détaillée.

source: Convert the string to binary.
fr: Convertit la chaîne en binaire.

source: Returns the number of bytes in a binary variant.
fr: Retourne le nombre d'octets d'un variable de type 'variant' binaire.

source: The binary data to evaluate.
fr: Les données binaires à évaluer.

source: Returns the length of the binary data in bytes.
fr: Retourne la longueur des données binaires en octets.

source: Create binary data from a string.
fr: Crée des données binaires à partir d'une chaîne.

source: Extracts a number of bytes from a binary variant.
fr: Extrait un nombre d'octets à partir d'une variable de type 'variant' binaire.

source: The byte position to start.
fr: La position de l'octet où commencer l'extraction.

source: (1 = first byte)
fr: (1 = premier octet)

source: The number of bytes to extract.
fr: Le nombre d'octets à extraire.

source: By default the entire remainder of the binary data.
fr: Par défaut tout le reste des données binaires.

source: Returns the extracted binary data.
fr: Retourne les données binaires extraites.

source: If start is out-of-bounds, an empty binary variant is returned.
fr: Si start est en dehors des limites, une variable binaire vide est retournée.

source: If start is valid but count is out-of-bounds, the entire remainder of the binary data is returned.
fr: Si start est valide mais count est en dehors des limites, tout le reste des données binaires est retourné.

source: Converts a binary variant into a string.
fr: Convertit une variable de type 'variant' binaire en une chaîne de caractère.

source: An expression to convert into a string.
fr: Une expression à convertir en chaîne.

source: Changes how the binary data is converted:
fr: Change la manière dont les données binaires sont converties:

source: 1 = (default) binary data is taken to be ANSI
fr: 1 = (défaut), les données binaires sont encodées avec la norme ANSI

source: 2 = binary data is taken to be UTF16 Little Endian
fr: 2 = les données binaires sont encodées en UTF16 Little Endian

source: 3 = binary data is taken to be UTF16 Big Endian
fr: 3 = les données binaires sont encodées en UTF16 Big Endian

source: 4 = binary data is taken to be UTF8
fr: 4 = les données binaires sont encodées en UTF8

source: the string representation of the binary data.
fr: Retourne la représentation de la chaîne en données binaires.

source: an empty string and sets the @error flag to non-zero.
fr: Retourne une chaîne vide et @error <> 0:

source: 1 = Input string had zero length.
fr: 1 = La chaîne d'entrée a une longueur nulle.

source: 2 = Input string had an odd number of bytes but was supposed to be UTF16 (must contain an even number of bytes to be valid UTF16).
fr: 2 = La chaîne d'entrée a un nombre impair d'octets, mais devait être en UTF16 (devait contenir un nombre pair d'octets pour être un codage UTF16 valide).

source: Unlike String() which returns a hexadecimal representation of binary data, this function will assume the binary data is a string value and convert it appropriately.
fr: Contrairement à String() qui retourne une représentation hexadécimale des données binaires, cette fonction supposera qu'une donnée binaire est une valeur chaîne et la convertira de manière appropriée.

source: Define the string that will be converted later.
fr: Définit la chaîne qui sera converti plus tard.

source: This string may show up as ??
fr: Cette chaîne peut apparaître comme ??

source: in the help file and even in some editors.
fr: dans le fichier d'aide et même dans certains éditeurs.

source: This example is saved as UTF-8 with BOM.
fr: Cet exemple est enregistré au format UTF-8 avec BOM.

source: It should display correctly in editors
fr: Il devrait s'afficher correctement dans les éditeurs

source: which support changing code pages based on BOMs.
fr: qui prennent en charge la modification des pages de code basée sur les BOMs.

source: Temporary variables used to store conversion results.
fr: Les variables temporaires utilisées pour stocker les résultats de conversion.

source: $dBinary will hold
fr: $dBinary contiendra

source: the original string in binary form and $sConverted will hold the result
fr: la chaîne d'origine sous forme binaire et $sConverted contiendra le résultat

source: afte it's been transformed back to the original format.
fr: après qu'il ait été converti à nouveau au format original.

source: Convert the original UTF-8 string to an ANSI compatible binary string.
fr: Convertit la chaîne d'origine UTF-8 en une chaîne binaire compatible ANSI.

source: Convert the ANSI compatible binary string back into a string.
fr: Convertit la chaîne binaire compatible ANSI en une chaîne.

source: Display the resulsts.
fr: Affiche les résultats.

source: Note that the last two characters will appear
fr: Notez que les deux derniers caractères s'affichent

source: as ??
fr: comme ??

source: since they cannot be represented in ANSI.
fr: car ils ne peuvent pas être représentés dans la norme ANSI.

source: Convert the original UTF-8 string to an UTF16-LE binary string.
fr: Convertit la chaîne d'origine UTF-8 en une chaîne binaire UTF16-LE.

source: Convert the UTF16-LE binary string back into a string.
fr: Convertit la chaîne binaire UTF16-LE en une chaîne.

source: Convert the original UTF-8 string to an UTF16-BE binary string.
fr: Convertit la chaîne d'origine UTF-8 en une chaîne binaire UTF16-BE.

source: Convert the UTF16-BE binary string back into a string.
fr: Convertit la chaîne binaire UTF16-BE en une chaîne.

source: Convert the original UTF-8 string to an UTF-8 binary string.
fr: Convertit la chaîne d'origine UTF-8 en chaîne binaire UTF-8.

source: Convert the UTF8 binary string back into a string.
fr: Convertit la chaîne binaire UTF8 en une chaîne.

source: Helper function which formats the message for display.
fr: Fonction d'aide qui formate le message pour l'affichage.

source: It takes the following parameters:
fr: Elle prend les paramètres suivants :

source: $sOriginal - The original string before conversions.
fr: $sOriginal - La chaîne d'origine avant la conversion.

source: $dBinary - The original string after it has been converted to binary.
fr: $dBinary - La chaîne d'origine après qu'elle ait été converti en binaire.

source: $sConverted- The string after it has been converted to binary and then back to a string.
fr: $sConverted- La chaîne après qu'elle ait été converti en binaire, puis de nouveau en une chaîne.

source: $sConversionType - A human friendly name for the encoding type used for the conversion.
fr: $sConversionType - Un nom convivial humain pour le type de codage utilisé pour la conversion.

source: Performs a bitwise AND operation.
fr: Exécute un 'ET' logique bit à bit.

source: The first number.
fr: Le premier nombre.

source: The second number.
fr: Le second nombre.

source: The nth number - up to 255 values can be specified.
fr: Le nième nombre - Jusqu'à 255 valeurs peuvent être spécifiées.

source: Returns the value of the parameters bitwise-AND'ed together.
fr: Retourne le "ET" logique entre les valeurs entrées en paramètres.

source: Bit operations are performed as 32-bit integers.
fr: Les opérations bit à bit sont effectuées comme entiers 32 bits.

source: Remember hex notation can be used for numbers.
fr: La notation hexadécimale peut être utilisée dans les arguments.

source: BitAND() returns 1 in each bit position where all input arguments have a 1 in the corresponding position and 0 in all others.
fr: BitAND() retourne 1 à chaque position de bit où tous les arguments donnés ont un 1 en position correspondante et 0 dans les autres cas.

source: "b" is the symbol for byte.
fr: "b" est le symbole pour 'byte' (octet).

source: Assign a Local variable the bitwise AND operation of 1 and 0.
fr: Assigne une variable 'Local' avec le résultat de l'opération AND de 1 et 0.

source: Assign a Local variable the bitwise AND operation of 1 and 1.
fr: Assigne une variable 'Local' avec le résultat de l'opération AND de 1 et 1.

source: Assign a Local variable the bitwise AND operation of 13 (1101b) and 7 (0111b).
fr: Assigne une variable 'Local' avec opération AND de 13 (1101b) et 7 (0111b).

source: Assign a Local variable the bitwise AND operation of 2 (0010b), 3 (0011b) and 6 (0110b).
fr: Assigne une variable 'Local' avec le résultat de l'opération AND de 2 (0010b), 3 (0011b) et 6 (0110b).

source: Performs a bitwise NOT operation.
fr: Exécute un "NON" logique bit à bit.

source: The number to operate on.
fr: La valeur à traiter.

source: Returns the bitwise NOT of the value.
fr: Retourne un "NON" logique de la valeur.

source: Remember that in 2's-complement notation, BitNOT() is functionally equivalent to adding 1 and negating the result.
fr: Rappelez-vous que dans la notation en complément à 2, la fonction BitNOT() est fonctionnellement équivalent à ajouter 1 et à prendre la négation du résultat.

source: Also remember that NOT changes a 0 bit to 1 and vice-versa.
fr: De même, rappelez-vous que le "NON" logique change 0 en 1 et vice-versa.

source: Assign a Local variable the bitwise NOT operation of 5.
fr: Assigne une variable locale le opération NON 5.

source: Performs a bitwise OR operation.
fr: Exécute un "OU" logique bit à bit.

source: Returns the two parameters bitwise-OR'ed together.
fr: Retourne le "OU" logique entre les valeurs entrées en paramètres.

source: BitOR() returns 0 in each bit position where all input arguments have a 0 in the corresponding position and 1 wherever there is at least one 1-bit.
fr: BitOR() retourne 0 pour chaque position de bit où tous les arguments ont un 0 en position correspondante et 1 partout où il y à au moins un bitt à 1.

source: Assign a Local variable the bitwise OR operation of 1 and 0.
fr: Assigne une variable locale le opération OU de 1 et 0.

source: 0001b OR 0000b = 0001b
fr: 0001b 0000b OU = 0001b

source: Assign a Local variable the bitwise OR operation of 1 and 1.
fr: Assigne une variable locale le opération OU de 1 et 1.

source: 0001b OR 0001b = 0001b
fr: 0001b 0001b OU = 0001b

source: Assign a Local variable the bitwise OR operation of 13 (1101b) and 7 (0111b).
fr: Assigne une variable locale le opération OU de 13 (1101b) et 7 (0111b).

source: 1101b OR 0111b = 1111b
fr: 1101b 0111b OU = 1111b

source: Assign a Local variable the bitwise OR operation of 2 (0010b), 3 (0011b) and 6 (0110b).
fr: Assigne une variable locale le opération OU de 2 (0010b), 3 (??0011b) et 6 (0110b).

source: 0010b OR 0011b OR 0110b = 0111b
fr: 0010b 0011b OU OU = 0110b 0111b

source: Performs a bit shifting operation, with rotation.
fr: Exécute un décalage bit à bit avec rotation.

source: The number to be operate on.
fr: La valeur à traiter.

source: [optional]Number of bits to rotate to the left (negative numbers rotate right).
fr: [optional] Nombre de bits à décaler vers la gauche (les nombres négatifs décalent à droite).

source: If not given, the default is 1.
fr: Si non donné, la valeur par défaut est 1.

source: A string that determines the rotation size, the default is (16 bits).
fr: Une chaîne de caractères déterminant la taille de la rotation (16 bits par défaut).

source: See below.
fr: (Consultez ci-dessous).

source: Size parameter :
fr: Paramètre Size :

source: rotate bits within the low-order byte (8 bits).
fr: Rotation à l'intérieur de l'octet de poids faible (8 bits).

source: rotate bits within the low-order word (16 bits).
fr: Rotation à l'intérieur du mot de poids faible (16 bits).

source: rotate bits within the entire double-word (32 bits).
fr: Rotation à l'intérieur d'un mot double (32 bits).

source: the value rotated by the required number of bits.
fr: Retourne la valeur de la rotation par le nombre de bits demandés.

source: Sets the flag @error to non-zero if size is invalid.
fr: @error <> 0 si la taille est incorrecte.

source: Assign a Local variable the bitwise left-rotate operation of 2.
fr: Assigne une variable locale avec une opération bit à bit de rotation à gauche de 2.

source: 2 = 0010b left-rotated once -> 4 = 0100b
fr: 2 = 0010b rotation gauche une fois -> 4 = 0100b

source: It is equivalent to do this:
fr: Il est équivalent de faire ceci:

source: Assign a Local variable the bitwise right-rotate operation of 1.
fr: Assigne une variable locale avec l'opération bit à bit d'une rotation vers la droite de 1.

source: 1 = 0001b right-rotated once -> 32768 (32 bits) = 1000 0000 0000 0000b
fr: 1 = 0001b rotation droite une fois -> 32768 (32 bits) = 1000 0000 0000 0000b

source: Assign a Local variable the bitwise right-rotate operation of 14.
fr: Assigne une variable locale avec une opération bit à bit de Rotation droite de 14.

source: 14 = 1110b right-rotated twice -> 32771 (16 bits) = 1000 0000 0000 0011b
fr: 14 = 1110b rotation droite deux fois -> 32771 (16 bits) = 1000 0000 0000 0011b

source: Assign a Local variable the bitwise right-rotate operation of 14 on 32 bits.
fr: Assigne une variable locale avec l'opération bit à bit de rotation droite de 14 sur 32 bits.

source: 14 = 1110b right-rotated twice -> -2147483645 (32 bits) = 1000 0000 0000 0000 0000 0000 0000 0011b (the first bit is signed)
fr: 14 = 1110b rotation droite deux fois -> -2147483645 (32 bits) = 1000 0000 0000 0000 0000 0000 0000 0011b (le premier bit est signé)

source: Performs a bit shifting operation.
fr: Exécute un décalage de bits.

source: The number to be shifted.
fr: La valeur à décaler.

source: Number of bits to shift to the right (negative numbers shift left).
fr: Le nombre de bits à décaler vers la droite (les nombres négatifs décalent à gauche).

source: Returns the value shifted by the required number of bits.
fr: Retourne la valeur décalée du nombre bits demandés.

source: Right shifts are equivalent to halving; left shifts to doubling.
fr: Les décalages à droite sont équivalents à des successions de divisions par deux; les décalages à gauche à des multiplications par deux.

source: Assign a Local variable the bitwise left-shift operation of 2.
fr: Assigne une variable locale de l'opération au niveau du bit de décalage à gauche de 2.

source: 2 = 0010b left-shifted once -> 4 = 0100b
fr: 2 = 0010b décalée à gauche une fois - > 4 = 0100b

source: Assign a Local variable the bitwise right-shift operation of 1.
fr: Assigne une variable locale l'opération de décalage à droite au niveau du bit de 1.

source: 1 = 0001b right-shifted once -> 0 = 0000b
fr: 1 = 0001b décalé à droite une fois - > 0 = 0000b

source: Assign a Local variable the bitwise left-shift operation of 14.
fr: Assigne une variable locale de l'opération au niveau du bit de décalage à gauche de 14 ans.

source: 14 = 1110b left-shifted twice -> 56 = 0011 1000b
fr: 14 = 1110b gauche décalé deux fois -> 56 = 0011 1000b

source: Assign a Local variable the bitwise
fr: Assigne une variable locale bit à bit

source: 1 = 0001b right-shifted 31 times -> -2147483648 (32 bits) = 1000 0000 0000 0000 0000 0000 0000 0000b
fr: 1 = 0001b décalé à droite 31 fois -> -2147483648 (32 bits) = 1000 0000 0000 0000 0000 0000 0000 0000b

source: Note: in 2's-complement notation, the 32nd digit from the right has a negative sign.
fr: Remarque : dans la notation complément à 2, le chiffre 32e de la droite a un signe négatif.

source: Performs a bitwise exclusive OR (XOR) operation.
fr: Exécute un "OU EXCLUSIF" logique bit à bit.

source: Returns the value of the parameters bitwise-XOR'ed together.
fr: Retourne le "OU EXCLUSIF" bit à bit des valeurs entrées en paramètres.

source: BitXOR() returns 1 in a bit position if there are an odd number of 1's in the corresponding bit position in all the input arguments, and 0 otherwise.
fr: BitXOR() retourne 1 pour chaque position de bit où on a un nombre impair de 1 en position correspondante dans tous les arguments, et 0 sinon.

source: Assign a Local variable the bitwise XOR operation of 1 and 0.
fr: Assigne une variable locale du XOR fonctionnement de 1 et 0.

source: 0001b XOR 0000b = 0001b
fr: 0001b 0000b XOR = 0001b

source: Assign a Local variable the bitwise XOR operation of 1 and 1.
fr: Assigne une variable locale du XOR fonctionnement de 1 et 1.

source: 0001b XOR 0001b = 0000b
fr: 0001b 0001b XOR = 0000b

source: Assign a Local variable the bitwise XOR operation of 13 (1101b) and 7 (0111b).
fr: Assigne une variable locale de l'opération au niveau du bit XOR de 13 (1101b) et 7 (0111b).

source: 1101b XOR 0111b = 1010b
fr: 1101b 0111b XOR = 1010B

source: Assign a Local variable the bitwise XOR operation of 2 (0010b), 3 (0011b) and 6 (0110b).
fr: Assigne une variable locale de l'opération au niveau du bit XOR de deux (0010b), 3 (??0011b) et 6 (0110b).

source: 0010b XOR 0011b XOR 0110b = 0111b
fr: 0010b 0011b XOR XOR 0110b = 0111b

source: Disable/enable the mouse and keyboard.
fr: Désactive/Active la souris et le clavier.

source: 1 = Disable user input
fr: 1 = Désactive les entrées clavier/souris de l'utilisateur

source: 0 = Enable user input
fr: 0 = Active les entrées clavier/souris de l'utilisateur

source: Already Enable or #RequireAdmin not used.
fr: Déjà activé ou #requireAdmin non utilisé.

source: The table below shows how BlockInput() behavior depends on the Windows version; however, pressing Ctrl+Alt+Del on any platform will re-enable input due to a Windows API feature.
fr: Le tableau ci-dessous montre le comportement de BlockInput() en fonction de la version de Windows; toutefois, quel que soit la plateforme, l'appui de Ctrl+Alt+Del réactive les entrées du fait des caractéristiques de l'API de Windows.

source: "BlockInput()" Results
fr: Résultat de BlockInput()

source: User input is blocked and AutoIt can simulate mouse and keyboard input.
fr: L'entrée utilisateur est bloquée et AutoIt peut simuler les entrées de la souris et du clavier.

source: See remarks below for an issue with Windows XP SP1.
fr: Consultez les remarques ci-dessous pour un problème avec Windows XP SP1.

source: User input is blocked and AutoIt can simulate mouse and keyboard if #RequireAdmin is used.
fr: L'entrée utilisateur est bloquée et AutoIt peut simuler les entrées de la souris et du clavier si #RequireAdmin est utilisé.
